const content = {
    "galaxy_1": `
    1. 워치번호 조회후 "착신전환(무료)_대표" 서비스 가입여부 확인
    2. 해당 서비스 클릭후 착신전환 그룹 설정에 고객의 메인 휴대폰 번호 그룹설정 여부 확인
    3. "원넘버서비스(무료)" 가입여부 확인
    4. HD보이스 서비스 정상 가입여부 확인
   
    ☞ 1,2,3,4, 정상 등록 및 가입상태 확인시 즉시 기술 호전환
    `,
    "galaxy_2": `
    -KT웨어러블 콜은 KT통신사 부가서비스 ( 동시착신 ,원넘버 발신 ,착신전환)이용을 위해 필수적으로
    필요한 앱
    -워치에는 기본적으로 설치돼 있으며 휴대폰엔 고객이 직접 설치해야됨
    (구글 플레이스토어,원스토어 통해서 진행)
    -무조건 폰에 KT웨어러블 콜 앱이 설치 돼 있어야만 앱 이용 가능함
    -착신전환은 폰이나 워치를 통해 수동입력 (Ex.*77+연결번호입력 + 통화버튼)후에도 설정 가능하지만 
    "동시착신,원넘버 발신" 기능은 반드시 KT웨어러블 콜 앱을 통해서만 설정 가능
    
    `,
    "galaxy_3": `
    1.동시착신 서비스
     : 고객이 폰을 먼곳에 두고 오거나 혹은 폰과 워치를 동시에 휴대하지 않은 상태에서 상대방이 고객의
     폰으로 전화를 걸면 폰으로 수신됨과 동시에 워치로도 수신되는 서비스
     (단 동시착신 서비스는 문자나 기타 앱 알림등은 해당되지 않고 <b>오로지 음성 통화만</b> 동시에 수신됨) 
     
     ※고객이 음성 통화 외에 문자나 카카오톡을 비롯한 각종 앱알림이 수신되지 않는다고 주장하면 갤럭시
     웨어러블 앱을 통해 알림 설정이 필요하며 이 경우 삼성전자 AS센터 번호를 알려주고 종결

    2.원넘버 발신 :
     : 고객이 폰을 먼곳에 두고 오거나 혹은 폰과 워치를 동시에 휴대하지 않은 상태에서 워치로 전화를 걸게
     되는 경우 고객의 워치회선 번호가 아닌 휴대폰 번호가 상대방측으로 표시되게끔 하는 기능
     
    ※위 서비스와 관련해 자주 묻는 질문과 관련한 답변
    1.원넘버 서비스 가입 &  착신전환 그룹설정이 안돼 있으면 위에 두 서비스는 이용이 안됩니다. 
    
    2.워치번호로 걸려오는 전화는 동시착신 서비스와 무관하게 워치번호에서만 수신이 됩니다.
    <mark>(동시착신은 오로지 메인폰으로 걸려온 전화만 워치에 같이 신호를 주는 서비스)</mark>
    
    3.휴대폰과 워치에 동시에 수신을 원하시면 => 동시착신 서비스 , 난 휴대폰으로 걸려오는 전화를 워치로 아니면
    워치로 걸려오는 전화를 휴대폰으로 받고 싶다면 => 착신전환 서비스
    
    4.폰으로 걸려오는 전화를 워치 말고 다른 휴대폰이나 번호로 받을수 있나요?
     =>착신전환 무료 서비스 가입상태이기 때문에 폰에서 *71+연결번호+통화 진행하면 타 번호로도 착신전환
     가능합니다 (굳이 물어보는 고객에게만 안내 필요 ) 
    `,
    "galaxy_4": `
     1.<mark>갤럭시 워치4 이후부턴</mark> 무조건 본인 명의던 타인 명의던 <mark>KT유심이 장착된 안드로이드 
     (삼성단말기)</mark>가 있어야 개통처리가 가능합니다.
      -KT유심이 장착된 본인 명의 , 타인 명의 단말기 자체가 없다면 워치4 이후부턴 이심프로파일
      설치및 다운로드 작업 자체가 불가능합니다.
      -현재 시중 유통되는 워치는 워치4 이후 단말기가 대부분이긴 하지만 정말 아주 가끔 갤럭시워치3나 
      이전 단말기 단독 개통을 문의하시는 경우가 있는데 이 경우 가능하다고 안내해주시면 됩니다.
      ( 이유 : 워치4 이후부터 워치 운영체제 변경 -> 삼성의 타이젠 에서 구글 wear os로 변경됨/ 애플따라하기 등등)
     
     2.갤럭시 워치 셀프 개통 및 셀프 기변불가 (KOS조회시 현재 이용불가한 워치가 조회되지 않는 상황)
     
     ※갤럭시 워치는 아래와 같이 자급모델에 한해서만 셀프 개통 및 기변이 가능합니다.
      모델명 : OMD_SM_WCH  
      고객이 삼성전자 대리점에서 직접 구입했다 혹은 셀프 개통,기변 가능한 모델인데 진행이 안된다  
     <mark>=> 그냥 싹다 대리점이나 플라자 내방통해 KOS개통 처리후 페어링 작업하시라고 안내하시면 됩니다.</mark> 
     WHY ? => 셀프 기변 or 개통이 안되는 상황을 전산으로 모니터링 할수 없으며 대리점 내방해
      개통 혹은 일반 기변 처리하고 페어링 작업하는게 가장 확실한 조치방법

      ※이미 전산상 해당 단말기가 번호 조회시 확인되는 개통상태임에도 이용이 안된다? 
      =>일반팀 전산체크 사항 확인후 기술호전환
    `,
   "apple_1" :`
   1. 워치번호 조회후 "원넘버서비스(무료)_애플" 가입여부 확인 
   2. "HD보이스" 가입여부 확인 
   3. 모단말은 무조건 아이폰인 경우에만 이용 가능
   `,
   "apple_2":`
   1. 애플워치는 갤럭시 워치와는 달리 kos에서 조회되는 <mark>워치 번호를 이용한 전화,문자등을
   이용할수 없음</mark> =>단 모(휴대폰)번호를 이용해 폰과 원거리 상태에서 이용은 가능
   
   2. only 매칭된 아이폰 회선을 이용해 전화,문자등이 가능한데 메인번호를 이용할수 있게끔
   연결해주는 기능을 "원넘버서비스(무료)_애플 서비스가 담당함
   
   3.서비스 가입시 모 번호를 입력하는 메뉴가 팝업되며 번호 입력후 가입하면 최종 적으로 전산
   연결상태가 됨
   `,
   "apple_3":`
   1. 무조건 아이폰 동일명의 사용중인 고객만 애플워치 개통가능
   
   2. 아이폰만 개통된 상태에서 애플워치 셀프 개통 시도 과정중 셀프 개통이 안돼요~! 문의는 
   대리점 혹은 플라자 내방통해 개통처리후 BT페어링 작업권유 안내
    (애플워치는 자급모델에 한해서 셀프 개통 및 기변 가능 Ex.AWU2C-00 와 같이 끝자리가 00으로 끝나는 모델)
   WHY ? => 셀프 기변 or 개통이 안되는 상황을 전산으로 모니터링 할수 없으며 대리점 내방해
      개통 혹은 일반 기변 처리하고 페어링 작업하는게 가장 확실한 조치방법
   
   3.KOS확인시 애플워치 개통상태가 맞다면 이후 워치 이용불가건은 통화품질팀으로 호전환 가능

   `,
   "global_1":`
   ※국제전화 발신제한 / 국제전화 수신차단서비스 가입여부 공통확인 / 서비스 가입시 국제문자도 수발신 불가함
    
    ㅇ국제전화 발신이 안돼요~! : 바로 인입된 고객은 우선 국제전화 부서로 호전환 (발송방법등 확인목적)
    
    ㅇ국제전화 발신이 안돼요~! 국제전화 부서에선 문제 없다는 데요? (국제부서에서 확인후 호전환 된경우)
     -국제전화부서 이상없음 확인 내용 적고 => 통화품질팀으로 호전환  
      `,
  "global_2":`
   ※국제전화 발신제한 / 국제전화 수신차단서비스 가입여부 공통확인 / 서비스 가입시 국제문자도 수발신 불가함
     
    ㅇ국제전화 수신이 안돼요~! : 국제전화 수신차단서비스 가입여부 확인후 =>통화품질팀 호전환
  `,
  "global_3":`
   ※국제전화 발신제한 / 국제전화 수신차단서비스 가입여부 공통확인 / 서비스 가입시 국제문자도 수발신 불가함
    
    ㅇ국제문자 발신이 안돼요~! : 바로 인입된 고객은 우선 국제전화 부서로 호전환 (발송방법등 확인목적) 
    
    ㅇ국제문자 발신이 안돼요~! 국제전화 부서에선 문제 없다는 데요? (국제부서에서 확인후 호전환 된경우)
     -국제전화부서 이상없음 확인 내용 적고 => 통화품질팀으로 호전환  
      `,
  "global_4":`
   
  ※국제전화 발신제한 / 국제전화 수신차단서비스 가입여부 공통확인 / 서비스 가입시 국제문자도 수발신 불가함
     
    ㅇ국제전화 수신이 안돼요~! : 국제전화 수신차단서비스 가입여부 확인후 =>통화품질팀 호전환
  ` ,
 "data_1":`
  1. 데이터 속도가 너무 느려요 거의 안되는거나 다름없어요 ( 월말에 집중 인입)
   QOS 확인 경로 : 사용량 정보 메뉴 진입후 조회 클릭 - 하단에 QOS/차단 상태조회 클릭시 
   화면 팝업됨 (MAX:속도제어상태 아님 / 그외 속도 제어 상태 ↓ 그림 참조)
  `,
 
  "data_2":`
  1.테더링 데이터 잔여량 확인 ( 소진 상태면 내용 안내후 종결)
  
  2.메인단말기 데이터 정상 접속여부 확인
  
  3. 1,2번 문제 없을 경우 테더링은 단말기 고유 기능으로써 휴대폰 제조사 
  혹은 특정 단말기만 테더링 접속이 안될 경우 해당 단말기 제조사로 문의 혹은 해당 
  단말 전원리셋후 사용 안내후 종결
  `,

  "data_3":`
  1.데이터 쉐어링 전산 결합 상태 확인
    -쉐어링 결합이 해지된 상태에선 쉐어링 회선이 정지되며 "무선데이터 차단서비스" 가입처리됨
    -쉐어링 결합 해지 원인 확인시 메인폰 요금제 세대와 쉐어링 서비스 세대가 같은지 무조건 확인
     (Ex.메인회선 5G요금제 + 쉐어링 LTE데이터쉐어링 , 혹은 반대의 경우 결합은 해지되며 정지됨)
    -확인 경로 : 반드시 휴대폰 번호로 조회 -> 요금제/부가 ->부가지원업무 -> [M]데이터쉐어링 가입/해지
                ※TIP.빠른 접근을 위해 KOS우측상단에 "쉐어링" 입력후 메뉴버튼 클릭
  
  2.요금제에 따라 쉐어링 전용 데이터 잔여량 확인 (테더링 & 핫스팟이 안돼요 메뉴에 사용량 조회 화면 참고)
  
  3.<mark>위 1,2번 문제 없는 경우 OMD변경등 시도 없이 통화품질팀 즉시 호전환 </mark>
    `, 


};

    const $li = $('ol li ul>li');
    const $li_M =$('ol li ul li ul');
    const $li_m =$('ol li ul li ul>li');
    const $first_menu = $('.first_menu');
    const $small_name = $('.small_name');
    const realmenu = $first_menu.find('li');
        
    realmenu.click(function(){
        var $id = $(this).attr('id');
            var $imgfile ="../imgfolder/"+ $id+'.jpg'
            console.log($imgfile);
            var $content = content[$id];
          $('#picture img').attr("src",$imgfile );
        
       
        $('#real_content').html($content);
    })

   
    $('img').mouseover(function(){
      $(this).stop().animate({height:80+'vh'},500);
    })
    $('img').mouseout(function(){
      $(this).stop().animate({height:300+'px'},500);
    })
   /* $first_menu.mouseover(function(){
        $(this).children().children().stop().slideDown()
    })
    
    $first_menu.mouseout(function(){
        $(this).children().children().stop().slideUp()
    }) */

   $small_name.click(function(){
   $(this).parent().find('li').toggle();
   })
