$(function(){
      
  class Salesment {
   constructor(classname,title,salecon){
     this.classname = classname;
     this.title = title;
     this.salecon = salecon;
   }
  }

//쌈마이 멘트 killing     
  var killing =[
new Salesment ("killing","3월27일교육 멘트(탭)",
`요즘은 큰TV 대신에 삼성갤럭시태블릿
으로TV를 볼수가 있는데 고객님께서는지금이벤트
대상자로6만원에 구입 가능 하시더라고요~
그래서 그 태블릿으로 TV실시간 으로보고 WIFI 연결
해서 유튜브나 넷플릭스도 볼수 있는 태블릿이라
혹시 필요하시다면 저렴하게 상담 받아보시고
결정 해보시는건어떠실까요?`),

new Salesment ("killing","3월27일교육 멘트(탭)",
`태블릿으로 집에서는 실시간으로 TV 도
볼수도있고,침대에누워서~아니면 이제집이나
밖에서는 요즘에 이제 뭐카페나 도서관에도
WIFI 많이있잖아요~ WIFI 연결해서유튜브나
넷플릭스, 인터넷도다사용가능하신 제품이거든요`),

new Salesment ("killing","3월27일교육 멘트(탭)",
`한가지 혜택 안내해드리면 인터넷과TV 
가입해서사용하시는데요~ 추가 가입시다른방에
TV 50 % 평생할인혜택제공되고있습니다.이벤트중인데~
저희가추가TV 가입하시면 지니TV 탭이라고 해서 갤럭시탭으로
TV 보실수 있게 갤럭시탭도 지금 저렴하게 지원해드리는
행사기간이에요~짧게 들어볼수 있도록 도움드릴까요?`),      

new Salesment ("killing","3월27일교육 멘트(탭)",
`지니TV 탭이라고 해서요 댁내 에서는 방거실 
이동하시면서TV 로시청을 하시다가 밖에서는 또WIFI 
연결해서 탭으로도 사용가능한 갤럭시탭이 고객님같은경우
탭TV 구매시 상품권도 많이 챙겨 드린다고 하는데 본사혜택
좋을때부담갖지마시고 내용한번들어보시는건어떠세요`),

new Salesment ("killing","MJ 공유멘트",
`현재까지 본사 혜택 중에 제일 인기많은 혜택이고
2월달 설맞이 깜짝이벤트로 어렵게 본사에서 소수 물량 확보해 
선착순으로 진행되는 상태입니다. 마저 혜택 챙겨가실수
있도록 담당자 연결해드릴까요?

설,추석,입학,졸업 등등 각 시기별 상황에 맞춰서 진행`),
new Salesment ("killing","대구센터 TV탭 멘트",
`★★ 탭으로 추가 티비 가입 시 ① 저렴하게 갤럭시탭 증정해드리고 
② 상품권 드리고 ③ 요금할인까지
지원해드리고 있어요~
>> 대구에서 사용하는 탭 권유멘트인데 마치 3가지 혜택을 
모두 가져갈수있다는 식으로 응대하고 있었습니다.`),
new Salesment ("killing","대구센터 TV탭 멘트",
`★★ 티비 가입 시 지금 더블 혜택 기간이라서 제가 연결해
드리면 상품권 추가 혜택이 있습니다.`),
new Salesment ("killing","대구센터 TV탭 멘트",
`★★ 인터넷 티비 가입 시 고객센터만의 혜택으로 사은품 
대신 요금할인을 선택해서 가장 저렴한 가격으로 인터넷 티비 
가입이 가능한데요~
가격 알아보시는건 어떠세요?`),
new Salesment ("killing","대구센터 TV탭 멘트",
`★★ 신년 이벤트로 휴대폰 기기변경과 인터넷 티비 가입 
시 최대 혜택 드리고 있습니다.
가격 알아보시는건 어떠세요?`),
new Salesment ("killing","tv탭 권유_네비게이션 게임 활용",
`손바닥 두개 만한 사이즈에 큰 핸드폰이라고 보시면 되고요 
집에서는 tv 로 보시고 외부에서는 youtube 라던지 아니면 
내비게이션으로도 사용하고  게임같은 것도 휴대폰 화면보다 훨씬
큰화면으로 돌리시면 재미있거든요 
이건 제가 써봐서 좋은건 압니다.
그냥 기계값만 40만원 다되는걸로 아는데 이번에 하시면 지원이 많이
돼서 부담금이 몇만원 안되는 걸로 알고 있는데 한번 상담이나 
받아보시죠?`),
new Salesment ("Killing","tv탭 권유_무더운 날씨",
`고객님 요새 너도 나도 찾는 핫한 상품하나 소개 시켜드리고 싶은데요~!
요새 날씨가 너무 덥잖아요 그럴때 안방에 작은 에어컨 하나 틀어놓으시고
삼성 10인지 테블릿하나 갖고 들어가셔서 누워서 보실수 있는 kt tv상품이
있거든요 .
조건이 좋고 신청자가 몰려서 바로 개통이 어렵긴 한데요 상담이나 
한번 받아보시죠~ 할인도 엄청 해드리는데 한번 연결해드릴까요?
`),
new Salesment ("Killing","tv권유",
`지금 테블릿 tv로 개통하는 상품이 한시적으로 풀렸는데 이건 
조건이 괜찮아서 저도 하나 했거든요
좋더라구요 5만원 밖에 안되는 상품이라 한번 이벤트 
끝나기 전에 상담이라도 받아보세요 저하고 친구도 하나 했거든요 
`),
new Salesment ("Killing","인터넷 추가 설치",
`고객님께서는 저희 인터넷 tv 전부 kt 로 이용하고 계시더라고요 
여기 고객님 자택 뿐만 아니라 다른 이제 가게 
라던지 이런 것에 에도 kt 인터넷설치하게 되시면 50 % 할인 
혜택을 받을 수가 있는데 안내 받아 보시겠어요?
`),
new Salesment ("Killing","인터넷+tv권유",
`근데요 고객님 모르시는 분들은 대형TV 돈주고 구입하시는데 요샌 
인+티 상품 조건 좋을때 개통하시면 대형tv가 사은품으로 지급 
되거든요. 조금 있음 입학시즌이라 통신사들끼리 엄청 경쟁하는데 
이럴때 상담 짧게 받아보시고 조건 비교해 보시면  
손해 보실거 없거든요?
`),
new Salesment ("Killing","tv권유",
`저희 본사에서 태블릿tv가 원래 가격보다도 이렇게까지 훨씬 
저렴하게 지원된 적이 잘 없어서 지금이 좋은 기회거든요 
실제로 반응이 좋아서 물량이 얼마 없는데 1~2분 내외로 간단
하게 안내 받아 보시고 결정해보시는 건  어떠세요?
`),
new Salesment ("Killing","인터넷+tv권유",
`댁에서 와이파이 없이 사용하시려면 답답하실텐데....
아무래도 와이파이가 LTE ,5G보단 훨신 안정적이거든요 
맘놓고 사용가능 하시고 유튜브, 
인터넷 라디오 하루종일 틀어놔도 안끊기고 데이터 
통화료 발생없는 인터넷+와이파이 하나씩은 돈도 얼마 
안해서 알아 보시는것도 손해 보실것 없거든요 . 
그리고 그만큼 휴대폰 요금제를 다운받으시면 더 경제적
이실수 있어서 한번 얘기나 들어보시죠 
`)
] 

// 보유상품(결합별) special
var special =[
new Salesment("special","■ 모바일 or 유선전화 단독 고객 ☞ 인터넷+TV 권유",
`혹시 혜택 챙겨드릴거 있는지 확인하다보니
인터넷 TV 가입 시 사은혜택으로 가전제품이나 백화점 상품권 제공되는데요,
안내 받아보시겠어요?
`),
new Salesment("special","■ 인터넷 + 모바일 결합 고객 ☞ TV 권유",
`고객님 kt 인터넷을 0년 동안 사용해주셨는데요~
TV도 가입해서 이용하시면 결합해서 저렴하게 이용하실 수 있고
여름맞이 이벤트로 상품권이나 사은품 등 혜택도 챙겨가실 수 있는데
이번 기회에 안내 받아보시는건 어떠세요?
`),
new Salesment("special","■ TV only & 모바일 이용 미결합 고객☞인터넷 권유",
`고객님 TV만 이용하고 계시는데, 인터넷 가입해서 결합하시면 
TV 요금도 저렴해지고,모바일도 같이 결합해서 할인 받아보실 
수 있거든요~~ 전화주신 김에 안내 받아보시는건 어떠세요?
`),
new Salesment("special","■ 인터넷+TV 기 이용 고객 ☞ 추가 티비 권유",
`고객님 추가 TV 가입하시면 평생동안 반값 할인 대상으로 
확인되세요~
이런 혜택 이벤트가 언제 끝날지 모르는건데,
기회되실 때 안내 받아보시는건 어떠세요?
 
(TV 없어요)
마침 지니TV 탭 행사도 있어서,
TV가 없는 고객님들도 신청 많이 하고 계시거든요~
선연결도 필요없고 WiFi 이용해서 집안 어디서든 편리하게 보실수 
있는데, 전화주신김에 안내받을 수 있도록 전문부서 
연결 해드려 볼게요!!
`)
]

// I,T,M동시 권유  newitm

var newitm =[
new Salesment("newitm","트리거/통리",
`1.우리는 kos화면에 [통] 아이콘 표기 고객만 합시다.

[멘트 : ]
“제가 업무 처리 하면서 확인해보니 때마침 고객님이 
휴대폰(과 인터넷을 함께) 오랜 기간 이용한
우수 고객님이어서 다양한 혜택을 먼저 챙겨 드리는 
프로모션 대상으로 확인되고 있는데요~
제가 고객님의 전담 부서로 바로 연결해드릴까요?"

[호전환 경로]
ㅇKOS 360뷰 하단 > 연계 > CRG 호전환 > M트리거징후_통합CRG

[S-VOC]
성공시 1차 반응->가입권유 성공 + 기타상품2 생성
`),
new Salesment("newitm","I,T,M동시권유",
`■ 권유멘트  
-"고객님! 여름맞이 행사로 인터넷과 TV를 가입하시면
LG 50인치 티비를 무료로 제공하고 있고      
현재 갤럭시 플립5나 폴더5 예약 기기변경 상담도 가능한데요~ 
전화주신 김에 혜택 가장 좋을 때 가격 알아보시는 거 어떠세요!?"
`)
]

// 유선상품이전  transfer

var transfer =[
new Salesment("transfer","유선 상품 설치변경(이전)",
`■이전할 때 신청 해야 설치비 저렴해지는점 중점 안내

권유멘트 :고객님, 이사하시는 김에 TV 추가 한 대 
더 가입해서 설치비도 할인받고 평생 반값으로 이용
해보시는 건 어떠세요?

■반론극복1
보통 다른 고객님들도 이런 혜택이 많으니 이사가실 때 
추가 TV 가입하시는 경우가 많더라구요~
요금과 혜택 상담 한번 받아보시는게 어떠세요?

■반론극복2
-추가로 사은품 또는 가전제품 제공해드리는 행사 중이라 
혜택 좋을 때 상담 한 번 받아보세요~

-나중에요~ : 지금 저희 고객센터 혜택이 너무 좋아요~ 
비교해보실 수 있도록 요금과 혜택 상담 한 번 받아보세요~  

-괜찮아요~ : 간단하게 요금과 혜택 안내 한 번 받아보세요~ 
자신있게 권해드립니다~
`),
new Salesment("transfer","유선 상품 설치변경(이사)",
`기존 주소지에 마저 거주할 가족이 있는지 탐색
(세대 분리 여부 탐색)

* 세대 분리인 경우  / 이설이 아닌 이사하는곳쪽에 인티 추가 가입 
혜택으로 권장 / 멘트는 자유롭게~

원래 살고 있는 집에도 가족분들이 
머무실 거잖아요~ 
기존 인터넷 tv는 기존 댁내에서 머무는 가족분들이 이용하시도록 
그대로 두고 새로 이사하시는 곳 쪽에 인터넷 TV를 신규 가입해주시면 

가족결합으로 50%할인도 들어가고 본사 특별 상품권도 받아 보실 수 있도록 
지원이 가능해서요 (상황에 따라 TV무료사은품 등으로도 어필)

인터넷 tv 추가 혜택으로 상담받아 보실 수 있도록
본사 담당자 연결해드려볼까요?
`)    
]

//인터넷 + TV    intt

var intt =[
new Salesment("intt","여름철 장마 맞이 멘트",
`<mark>로봇청소기 / 제습기등 다양한 사은품 언급</mark>

-여름 너무 습하고 더우시죠? 빨래도 안마르고 냄새나고
더운데 청소하시려면 귀찮으시잖아요?
이왕하실거 지금 인터넷 티비 신청하시면 제습기나 , 로봇청소기
사은품으로 가능하거든요. 돈 이중으로 쓰지 마시고 상담한번 
받아보세요
`),
new Salesment("intt","인터넷 TV동시 권유",
`고객님 지금 봄맞이 특별 프로모션으로 인터넷 TV같이 
가입하시면 50인지 삼성 TV에 상품권까지 추가로 드리고 
있는 역대급 혜택이 있는데 상담 한번 받아 보시겠어요?

TV가 필요 없으시면 공기 청정기 건조기등 다양한 제품이 
준비되어 있어요 어렵게 준비한 프로모션이라 수량 남아
있을때 상담 한번 받아보실수 있게 연결해드릴까요?
`),
new Salesment("intt","[인터넷+TV-일반전화만 있는 고객]",
`권유멘트 : 고객님~!전화만 이용중이시던데 인터넷과 TV도 
같이 가입 해서 사용하시면 요금할인은 기본이고 
43인지 TV 또는 삼성 공기청정기등 무료로 제공하는 
프로모션 진행 중이라 상담 한 번 받아보시는건 어떠세요?

※아니요 됐어요 : 추가로 사은품 또는 가전제품 제공해드리는 
행사 중이라 혜택 좋을때 상담 한번 받아보세요~!

※나중에요~! :지금 저희 고객센터 혜택이 너무 좋아요~! 
비교해 보실수 있도록 요금과 혜택 상담 한번 받아보세요 
몇 분 밖에 안걸려요

※괜찮아요 : 간단하게 요금과 혜택 안내 한번 받아보세요~ 
자신있게 권해드리고 짧게 설명해드리니 마음에 안드시면 
그냥 안한다고 하심 됩니다 ~! 
`),
new Salesment("intt","[인터넷 + TV]",
`고객님~ 지금 인터넷과 TV는 가입이 안되어 있으신데 인터넷과
TV 같은 통신 상품은 지금금 같은 월초나 입학, 졸업 시즌에 
가입하셔야 더 좋은 혜택을 받을 수 있는데요~ 
전화주신김에 잠깐 상담받아보시는거 어떠세요?
`),
new Salesment("intt","[인터넷 + TV ]_넷플릭스",
`요금 넷플릭스를 많이 이용하시는데요~ 지금 KT에서 인터넷과 TV를
함께 가입하시면 상품권도 제공할 뿐만 아니라 , 올레 TV를 통해 
넷플릭스를 바로 시청 할수 있는데요~
이왕 전화주신김에 상담 받아 보시겠습니까?
`),
new Salesment("intt","[인터넷 + TV ]_와이파이무료제공",
`우리 고객님 저희 kt를 오랜기간 이용해주고 있으신데 인터넷과 
tv를 추가로 이용하시면 기가 와이파이도 무료로 제공해드리고 
가전 제품이나 상품권도 제공해 드리는 혜택이  
있는데요 전화 주신김에 혜택상담 받아보시도록 전문 상담사 
연결 해드릴까요?
`)
]

// TV복수포함     tv
var tv=[
new Salesment("tv","연려층에 따른 TV권유",
`고객님! 자택에서 TV는 보고 계실 텐데요~ KT에서도 TV가 
따로 있어서 이번에 가입 하시면 다시 보기도 하실 수 
있고 채널수도 다양합니다. 
예를 들어 '미스터트롯' 같은 경우에도 다시 보기를 
맘껏 하실 수 있거든요~ 
가입 전문 상담사 연결해드릴까요?"""	
`),
new Salesment("tv","시중보다 저렴하게 TV득템 ",
`고객님 지금 추가 TV 가입하시면 시중가보다 TV 저렴하게 
구입도 가능하고요~가족끼리 다툼도 없이 거실에서 TV보고, 
안방에서도 TV 보고~ 얼마나 좋은지 몰라요~ 잠시 상담 
받을 수 있게 연결해드릴까요?"
`),
new Salesment("tv","각방마다 tv권유 ",
`요즘은 각 방마다 tv를 설치해서 보시는데요 ......
추가하는 TV는 50% 할인된 가격으로 시청 가능하고 상품권까지
제공해드립니다.
기존 kt이용 고객님들만을 위한 할인 혜택이니 놓치지 말고 
상담 연결 도와드릴까요?
`),
new Salesment("tv","갤럭시탭 활용",
`고객님 한시적 이벤트로 갤럭시탭 상품을 5만원에 구입 가능한데요~
집에서는 TV로 보시고 밖에서는 WiFi 연결해서 유튜브등 동영상 볼 수 
있는 TV탭 상품 가입해보시는 건 어떠세요? 
`),
new Salesment("tv","TV_큰화면으로 넷플리스 시청",
`지금 TV를 가입하시면 집에서 큰 화면으로 넷플릭스를 생생하게 
시청하실수 있고 다양한 프로모션도 진행중인데 상담 받아보시도록 
연결해드릴까요?
`),
new Salesment("tv","850만 가입자",
`지금 TV는 사용을 안하시는데 850만 가입자가 선택한 1등 브랜드인
KT TV를 가입 하시면 다양한 혜택을 누릴 수가 있습니다 . 
마침 이벤트 기간이라 상품권도 제공해 드리는데요 전화 주신김에 
혜택 상담 받아보시도록 연결해드릴까요?
`),
new Salesment("tv","복수TV_가족끼리 각자 채널선택",
`추가 TV를 가입하시면 가족끼리 보고 싶은 채널이 다를 땐 편하게 
시청 할 수 있고 기존에 있는 TV요금에 반값으로 가능한데 이왕 
전화주신김에 상담 받아보시겠습니까?
`),
new Salesment("tv","평생 티비 50%할인",
`현재 평생 50% 할인 된 금액으로 추가 TV를 이용하 실 수 있는 
특별 이벤트가 진행되고 있어요~ 게다가 지금 가입하시면 사은품으로 
상품권도 드리고 있어서 좋은 기회인데 전문 상담사 연결해드릴까요?
`),
new Salesment("tv","tv온리 인터넷 추천",
`지금 TV마나 사용 중이신데 인터넷도 추가로 가입해서 결합하면 
TV요금도 할인 받아 저렴하게 이용 가능한데 이왕 전화 주신김에 
상담 받아 보시겠습니까?
`),
new Salesment("tv","tv온리 인터넷 추천",
`지금 인터넷은 따로 없는 걸로 확인 되시는데요~ 요금에는 
대부분 인터넷도 같이 가입해서 결합해서 많이 사용하시거든요 ~ 
때마침 인터넷만 가입하셔도 상품권 드리는 이벤트 중인데 
이왕 전화 주신김에 상담 받아 보시겠습니까?
`),
new Salesment("tv","tv온리_와이파이 추천",
`스마트 폰이 있다면 와이파이로 사용할 수 있어서 휴대폰 통신료 
부담도 줄어들고 인터넷을 사용하신다면 지금 TV요금도 같이 할인이 
되거든요~ 전문 상담사와 통화해보시는건 어떨까요?
`)
]


// tv온리 고객  -> tvonly
var tvonly =[

]


// 반론극복 - >  banron

var banron =[

new Salesment("banron","자녀 때문에 TV없애려고요~!",
`실제로 댁에 자녀가 있는 경우엔  테블릿 화면을 
통해 부모님만 프라이빗하게 tv 시청이 가능하시고, 
인터넷은 사용하시면서 자녀들의 tv 시청은  
차단하실 목적으로 테블릿 tv로 혜택 신청 많이 하십니다. 

`),
new Salesment("banron","지금 받아야됨 ? 나 바뻐~!",
`잠시 통화해보시고 혹시라도 통화가 길어질 것 같으면
나중에 편하신 시간대에 다시 연락 달라고 말씀하셔도
전혀 문제 없으세요 ( 관계 없으세요 )
`),

new Salesment("banron","난 잘몰라요~! / 혜택 필요없어요~!",
`아 그러면 고객님 혹시 잘 모르는 혜택을 
놓치시는 게 아까워서 저희가 본사에서 무료 상담 
지원하는 거라서 한번 들어보고
원하시면 가족분들이랑 상의하신 다음에 결정하셔도 
상관없으니 한번 연결해드려 볼까요?
`),

new Salesment("banron","아니요 됐어요~!!",
`아니요 됐어요~! 
☞ 이번달 선착순 사은품 혜택이 너무 좋아서 챙겨 드리려고
말씀 드렸어요~
☞ 기회가 너무 좋아서 놓치기 아까운데 상담 한번 받아 
보시는게 어떠세요?
`),
new Salesment("banron","나중에 할께요~!",
`고객님 지금 특수 시즌이거든요?  고객혜택이 가장 
좋을떄고 그리고 지금까지 kt에서 가전제품과 상품권을 동시에 
제공한 적은 없었습니다.
이런 좋은 기회가 사실 언제까지 유지될지 알수가 없거든요.
너무 아까워서 말씀 드렸는데 잠깐 가격이라도 비교해 보시는건 
어떠세요?
`),
new Salesment("banron","타사꺼 쓰고 있어요~!",
`고객님 그럼 더욱 알아보셔야 하는게 타사 사용중이면 월 금액을 
지불 하시잖아요?
KT 인터넷 TV가격은 어떤지 알아보시고 타사랑 비교해서 금액적으로 
더 유리한 곳으로 선택하는게 고객님께 더 이득이 되실 텐데요 
이왕 전화 주신김에  지금 최고의 혜택까지 챙겨드리는 이벤트 
중이니 가격 비교부터 해보시는건 어떠세요?
`),
new Salesment("banron","시간없어요 바빠요~!!",
`☞통화하시기 편한 시간에 전화 드릴 수 있습니다~
몇 시가 편하세요?
          
☞간단하게 안내해드리고 있어서 잠깐의 통화로도 
확인 가능하구요 이후에 상세한 상담은  편한 시간에
다시 전화드릴 수도 있습니다.
`),
new Salesment("banron","기타 반론극복",
`ㅇ 이렇게 고객센터 전화주시는 일이 많지 않으신데~ 
전화 주신 김에~ 짧게 1~2분 정도되는 안내니까 한번 
들어라도 보세요~

ㅇ 혜택이 좋은데 대부분 몰라서 못받으시는 분들이 대부분
이라서~ 아쉬워서 말씀 드리는 거라~ 한번 전문 상담 받아보시겠어요?

ㅇ저도 했거든요 쓸만한 기회가 맞아서 말씀만 들어보셔도 전혀 손해
보실일 없을겁니다. 
`)   
]

// 각 라디오 버튼 별 밸류 모음 / 클래스 이름도 되고 배열 이름도 됨 ↓
var talklist ={'killing':killing,'special':special,'newitm':newitm,
              'transfer':transfer,'intt':intt,'tv':tv,'tvonly':tvonly,
             'banron':banron };

  //각 항목에 ID값 넣기
  $('#radio label input').each(function(){
    var $raval = $(this).val();
    $(this).attr('id',$raval);
  })

  //셀렉트하고 미리 보여주기
  function start_show(){
    var show_val = localStorage.getItem('salradio');
    var ment1 = talklist[show_val];
    $('#'+show_val).prop('checked',true);
    $('pre').not('pre.'+show_val).hide();
    $('.tab2,img').hide();
     $('.banronrule').hide();
     $('.onse').hide();
    if(show_val !=='tab2' || show_val !=='banron1' || show_val !=='onse'){
     for ( var i=0 ; i < ment1.length ; i++){
         $('#Salescon').append(`<pre class="${ment1[i].classname}"><b>${ment1[i].title}</b><br><br>${ment1[i].salecon}</pre>`)
     }
     $('.onse').hide();
     $('.tab2,img').hide();
     $('.banronrule').hide();
     }else if(show_val ==='tab2'){
         $('pre').hide();
         $('.tab2,img').show();
         $('.banronrule').hide();
     }else if(show_val ==='banron1'){
         $('pre').hide();
         $('.tab2,img').hide();
         $('.banronrule').show();
  }}



   $('#radio label input').change(function(){
    var val = $(this).val();
    localStorage.setItem('salradio',val);
          
      if(val !=='tab2' && val !=='banron1' && val !=='onse'){
        var ment = talklist[val]
        $('#Salescon').empty();
       for ( var i=0 ; i < ment.length ; i++){
           $('#Salescon').append(`<pre class="${ment[i].classname}"><b>${ment[i].title}</b><br><br>${ment[i].salecon}</pre>`)
       }
       $('pre').not('pre.'+val).hide();
       $('.tab2,img').hide();
       $('.onse,iframe').hide();
       $('.banronrule,iframe').hide();
       }else if(val ==='tab2'){
        $('pre').hide();
        $('.tab2,img').show();
        $('.banronrule').hide();
        $('.onse,iframe').hide()
        }else if(val ==='banron1'){
        $('pre').hide();
        $('.tab2,img').hide();
        $('.banronrule,iframe').show();
        $('.onse').hide()
       }else if(val ==='onse'){
        $('pre').hide();
        $('.tab2,img').hide();
        $('.banronrule').hide();
        $('.onse,iframe').show()
     }
      });
   
   $('#Salescon').on('mouseenter','pre',function(){
     $(this).css({'font-weight':'bold','background-color': 'beige'});
   $('pre').mouseleave(function(){
     $(this).css({'font-weight':'normal','background-color': 'white'});
   })
   });

  /* $('.tab2 img').mouseenter(function(){
     $(this).css('height','600px').mouseleave(function(){
         $(this).css('height','350px');
     })

   }) */

   $('.tab2 img').mouseenter(function(){
     $(this).stop().animate({height:600+'px'},500).mouseleave(function(){
         $(this).stop().animate({height:350+'px'},500);
     })

   })

   start_show();

 })







