jQuery(function(){
    // 월표시 
    class Schedule {
        constructor(mo,week,yun1,yun2,yun3,heal1,heal2,heal3,healtime,dang1,dang2,day2,week2,memo){
            this.mo = mo;
            this.week = week;
            this.yun1 = yun1;
            this.yun2 = yun2;
            this.yun3 = yun3;
            this.heal1 = heal1;
            this.heal2 = heal2;
            this.heal3 = heal3;
            this.healtime = healtime;
            this.dang1 = dang1;
            this.dang2 = dang2;
            this.day2 = day2 ;
            this.week2 = week2 ;
            this.memo = memo ;     }
           }
  
//1월

var schedule1 =[

    new Schedule("1일","일",".",".",".",".",".",".",".",".",".","1일","일","."),
    new Schedule("2일","월",".",".",".",".",".",".",".","박정범",".","2일","월","."),
    new Schedule("3일","화","이진우",".",".",".",".",".",".","이한기",".","3일","화","."),
    new Schedule("4일","수",".",".",".","백금옥",".",".","1130(유)","김정훈",".","4일","수","정기평가일"),
    new Schedule("5일","목","김정훈(반)",".",".",".",".",".",".","최민지",".","5일","목","."),
    new Schedule("6일","금","김정훈",".",".","최아람","이윤복",".","1030(유)/13(남)","박정범",".","6일","금","."),
    new Schedule("7일","토",".",".",".",".",".",".",".","(제)김정훈",".","7일","토","."),
    new Schedule("8일","일",".",".",".",".",".",".",".",".",".","8일","일","."),
    new Schedule("9일","월",".",".",".",".",".",".",".","이한기",".","9일","월","정범교육"),
    new Schedule("10일","화","박주영",".",".",".",".",".",".","박정범",".","10일","화","오스타/의료비 마감"),
    new Schedule("11일","수","박정범",".",".","박주영",".",".","1030(남)","최민지",".","11일","수","리스크예방데이"),
    new Schedule("12일","목","최아람",".",".","이진우",".",".","1030(유)","이한기",".","12일","목","."),
    new Schedule("13일","금",".",".",".","이한기",".",".","13(남)","김정훈",".","13일","금","17:30~18:00휴근교육A존회의실"),
    new Schedule("14일","토",".",".",".",".",".",".",".","(동)이한기",".","14일","토","."),
    new Schedule("15일","일",".",".",".",".",".",".",".",".",".","15일","일","."),
    new Schedule("16일","월",".",".",".",".",".",".",".","최민지",".","16일","월","."),
    new Schedule("17일","화","이윤복",".",".",".",".",".",".","최민지",".","17일","화","."),
    new Schedule("18일","수",".",".",".","김정훈",".",".","1130(남)","이한기",".","18일","수","."),
    new Schedule("19일","목","백금옥",".",".",".",".",".",".","박정범",".","19일","목","통신비 취합"),
    new Schedule("20일","금","최민지",".",".","박정범",".",".","1130(유)","김정훈",".","20일","금","."),
    new Schedule("21일","토",".",".",".",".",".",".",".","(제)김정훈",".","21일","토","."),
    new Schedule("22일","일",".",".",".",".",".",".",".","(동)최민지","박정범","22일","일","."),
    new Schedule("23일","휴일",".",".",".",".",".",".",".","(제)최민지",".","23일","휴일","."),
    new Schedule("24일","휴일",".",".",".",".",".",".",".","(제)이한기",".","24일","휴일","."),
    new Schedule("25일","수","이윤복(공)",".",".",".",".",".",".","김정훈",".","25일","수","."),
    new Schedule("26일","목","이윤복(공)",".",".",".",".",".",".","박정범",".","26일","목","."),
    new Schedule("27일","금","이한기","이윤복(공)",".","최민지",".",".","1030(남)","최민지",".","27일","금","."),
    new Schedule("28일","토",".",".",".",".",".",".",".","(동)박정범",".","28일","토","."),
    new Schedule("29일","일",".",".",".",".",".",".",".",".",".","29일","일","."),
    new Schedule("30일","월","이윤복(공)",".",".",".",".",".",".","이한기",".","30일","월","16~18시 신입교육"),
    new Schedule("31일","화","이윤복(공)",".",".","백금옥",".",".","1130(남)","최민지",".","31일","화",".")

]

//2월
var schedule2 =[
    new Schedule("1일","수",".",".",".",".",".",".",".","이한기",".","1일","수","."),
    new Schedule("2일","목",".",".",".",".",".",".",".","최민지",".","2일","목","."),
    new Schedule("3일","금",".",".",".","이진우",".",".","13(남)","김정훈",".","3일","금","연말정산 입력 마감"),
    new Schedule("4일","토",".",".",".",".",".",".",".","(제)박정범",".","4일","토","."),
    new Schedule("5일","일",".",".",".",".",".",".",".",".",".","5일","일","."),
    new Schedule("6일","월",".",".",".",".",".",".",".","최민지",".","6일","월","유선교육(팀장)/성분회의"),
    new Schedule("7일","화",".",".",".","이한기",".",".","14(남)","이한기",".","7일","화","."),
    new Schedule("8일","수","박주영",".",".","최아람","박정범",".","1030(유)/14(남)","박정범",".","8일","수","업무지식평가"),
    new Schedule("9일","목","박주영",".",".",".",".",".",".","최민지",".","9일","목","오스타 시상식"),
    new Schedule("10일","금","김정훈","박주영",".","최민지",".",".","13(유)","최민지",".","10일","금","정범신입교육 /의료비 마감"),
    new Schedule("11일","토",".",".",".",".",".",".",".","(동)김정훈",".","11일","토","."),
    new Schedule("12일","일",".",".",".",".",".",".",".","(제)박정범","이한기","12일","일","."),
    new Schedule("13일","월","최민지",".",".",".",".",".",".","박정범",".","13일","월","."),
    new Schedule("14일","화","이진우",".",".",".",".",".",".","이한기",".","14일","화","통품 정평일"),
    new Schedule("15일","수","이한기","최아람",".",".",".",".",".","최민지",".","15일","수","."),
    new Schedule("16일","목",".",".",".",".",".",".",".","박정범",".","16일","목","."),
    new Schedule("17일","금","백금옥",".",".","이한기",".",".","1030(남)","김정훈",".","17일","금","통신비 마감"),
    new Schedule("18일","토",".",".",".",".",".",".",".","(제)최민지",".","18일","토","."),
    new Schedule("19일","일",".",".",".",".",".",".",".",".",".","19일","일","."),
    new Schedule("20일","월",".",".",".",".",".",".",".","박정범",".","20일","월","."),
    new Schedule("21일","화",".",".",".",".",".",".",".","이한기",".","21일","화","."),
    new Schedule("22일","수","박정범",".",".","박주영",".",".","1030(남)","최민지",".","22일","수","."),
    new Schedule("23일","목","이윤복","최아람",".","김정훈",".",".","1130(남)","백금옥",".","23일","목","."),
    new Schedule("24일","금",".",".",".","이윤복",".",".","1030(유)","김정훈",".","24일","금","."),
    new Schedule("25일","토",".",".",".",".",".",".",".","(동)김정훈",".","25일","토","."),
    new Schedule("26일","일",".",".",".",".",".",".",".",".",".","26일","일","."),
    new Schedule("27일","월",".",".",".",".",".",".",".","김정훈",".","27일","월","나 신입교육 /유선교육(팀장)"),
    new Schedule("28일","화",".",".",".","백금옥",".",".","1030(유)","박정범",".","28일","화",".")
] 

//3월
var schedule3 =[
    new Schedule("1일","휴일",".",".",".",".",".",".",".","(제)이한기",".","1일","휴일","."),
    new Schedule("2일","목","이윤복(반)",".",".",".",".",".",".","박정범",".","2일","목","아침행사"),
    new Schedule("3일","금",".",".",".",".",".",".",".","김정훈",".","3일","금","."),
    new Schedule("4일","토",".",".",".",".",".",".",".","(제)최민지",".","4일","토","."),
    new Schedule("5일","일",".",".",".",".",".",".",".","(동)김정훈","박정범","5일","일","."),
    new Schedule("6일","월","최아람",".",".",".",".",".",".","백금옥",".","6일","월","유선교육_나"),
    new Schedule("7일","화","최아람",".",".","이진우",".",".","1030(유)","최민지",".","7일","화","."),
    new Schedule("8일","수","최아람",".",".","이윤복",".",".","1030(유)","최민지",".","8일","수","정기평가일 /리스크 데이 "),
    new Schedule("9일","목","이진우",".",".","이한기",".",".","13(남)","이한기",".","9일","목","."),
    new Schedule("10일","금","이진우","최민지",".",".",".",".",".","김정훈",".","10일","금","휴가취합 마감 /의료비"),
    new Schedule("11일","토",".",".",".",".",".",".",".","(동)박정범",".","11일","토","."),
    new Schedule("12일","일",".",".",".",".",".",".",".",".",".","12일","일","."),
    new Schedule("13일","월",".",".",".",".",".",".",".","박정범",".","13일","월","."),
    new Schedule("14일","화",".",".",".",".",".",".",".","이한기 ",".","14일","화","통품 자체 정평일"),
    new Schedule("15일","수",".",".",".",".",".",".",".","이한기 ",".","15일","수","."),
    new Schedule("16일","목","백금옥",".",".","최민지",".",".","1030(남)","박정범",".","16일","목","."),
    new Schedule("17일","금","박주영",".",".",".",".",".",".","김정훈",".","17일","금","통신비 마감"),
    new Schedule("18일","토",".",".",".",".",".",".",".","(제)최민지",".","18일","토","."),
    new Schedule("19일","일",".",".",".",".",".",".",".",".",".","19일","일","."),
    new Schedule("20일","월",".",".",".",".",".",".",".","최민지",".","20일","월","생일의 날"),
    new Schedule("21일","화",".",".",".",".",".",".",".","이한기",".","21일","화","."),
    new Schedule("22일","수","박정범",".",".","박주영",".",".","1030(유)","이한기",".","22일","수","."),
    new Schedule("23일","목",".",".",".","최아람",".",".","13(남)","백금옥",".","23일","목","."),
    new Schedule("24일","금","이한기",".",".","박정범",".",".","1130(남)","김정훈",".","24일","금","."),
    new Schedule("25일","토",".",".",".",".",".",".",".","(동)김정훈",".","25일","토","."),
    new Schedule("26일","일",".",".",".",".",".",".",".",".",".","26일","일","."),
    new Schedule("27일","월",".",".",".",".",".",".",".","이한기",".","27일","월","유선교육_나"),
    new Schedule("28일","화",".",".",".",".",".",".",".","최민지 ",".","28일","화","."),
    new Schedule("29일","수",".",".",".","백금옥",".",".","1030(남)","박정범",".","29일","수","."),
    new Schedule("30일","목","김정훈",".",".","최아람",".",".","13(남)","최민지",".","30일","목","."),
    new Schedule("31일","금","이윤복(반)",".",".","김정훈",".",".","13(유)","이한기",".","31일","금",".")
]

//4월
var schedule4 = [
    new Schedule("1일","토",".",".",".",".",".",".",".","(제)최민지",".","1일","토","."),
    new Schedule("2일","일",".",".",".",".",".",".",".","(동2명)백금옥","박정범","2일","일","."),
    new Schedule("3일","월",".",".",".",".",".",".",".","박정범",".","3일","월","동작당직 주간"),
    new Schedule("4일","화","이진우",".",".",".",".",".",".","이한기",".","4일","화","."),
    new Schedule("5일","수","박정범",".",".",".",".",".",".","최민지",".","5일","수","정기평가(면제)"),
    new Schedule("6일","목","박정범",".",".","이윤복",".",".","1130(유)","이한기",".","6일","목","."),
    new Schedule("7일","금","박정범",".",".","이진우",".",".","1030(남)","최민지",".","7일","금","."),
    new Schedule("8일","토",".",".",".",".",".",".",".","(동)김정훈",".","8일","토","."),
    new Schedule("9일","일",".",".",".",".",".",".",".",".",".","9일","일","."),
    new Schedule("10일","월",".",".",".",".",".",".",".","김정훈",".","10일","월","정범교육/통품정평/의료비"),
    new Schedule("11일","화","최아람","이윤복(반)",".",".",".",".",".","이한기",".","11일","화","."),
    new Schedule("12일","수","최민지",".",".","이한기",".",".","14(남)","백금옥",".","12일","수","."),
    new Schedule("13일","목","최민지",".",".","박주영",".",".","1030(남)","박정범",".","13일","목","."),
    new Schedule("14일","금","최민지",".",".","최아람",".",".","1030(유)","김정훈",".","14일","금","."),
    new Schedule("15일","토",".",".",".",".",".",".",".","(제)박정범",".","15일","토","."),
    new Schedule("16일","일",".",".",".",".",".",".",".",".",".","16일","일","."),
    new Schedule("17일","월",".",".",".",".",".",".",".","이한기",".","17일","월","동작당직 주간/생일의 날"),
    new Schedule("18일","화","이윤복",".",".",".",".",".",".","박정범",".","18일","화","통신비"),
    new Schedule("19일","수","이한기",".",".",".",".",".",".","최민지",".","19일","수","."),
    new Schedule("20일","목","박주영",".",".","백금옥",".",".","14(남)","이한기 ",".","20일","목","나 교육"),
    new Schedule("21일","금","박주영",".",".","최민지",".",".","1030(유)","박정범",".","21일","금","."),
    new Schedule("22일","토",".",".",".",".",".",".",".","(동)김정훈",".","22일","토","."),
    new Schedule("23일","일",".",".",".",".",".",".",".","(제2명)최민지","이한기","23일","일","."),
    new Schedule("24일","월",".",".",".",".",".",".",".","최민지",".","24일","월","멀티리더 육성과정"),
    new Schedule("25일","화",".",".",".",".",".",".",".","백금옥",".","25일","화","체육행사"),
    new Schedule("26일","수","백금옥",".",".","박정범",".",".","13(남)","박정범",".","26일","수","."),
    new Schedule("27일","목","백금옥",".",".",".",".",".",".","이한기",".","27일","목","."),
    new Schedule("28일","금","백금옥",".",".","김정훈",".",".","1030(유)","김정훈",".","28일","금","."),
    new Schedule("29일","토",".",".",".",".",".",".",".","(제)이한기",".","29일","토","."),
    new Schedule("30일","일",".",".",".",".",".",".",".",".",".","30일","일","."),
    new Schedule("1일","휴일",".",".",".",".",".",".",".",".",".","1일","휴일",".")
]

//5월

var schedule5 =[

    new Schedule("1일","휴일",".",".",".",".",".",".",".","(제)이한기",".","1일","휴일","."),
    new Schedule("2일","화",".",".",".",".",".",".",".","박정범",".","2일","화","."),
    new Schedule("3일","수","이진우",".",".","이윤복",".",".","1130(남)","백금옥",".","3일","수","업무지식평가"),
    new Schedule("4일","목","이진우",".",".","이한기",".",".","13(유)","최민지",".","4일","목","정범교육14~15"),
    new Schedule("5일","휴일",".",".",".",".",".",".",".","(동)김정훈",".","5일","휴일","."),
    new Schedule("6일","토",".",".",".",".",".",".",".","(동)박정범",".","6일","토","."),
    new Schedule("7일","일",".",".",".",".",".",".",".",".",".","7일","일","."),
    new Schedule("8일","월",".",".",".",".",".",".",".","박정범",".","8일","월","오스타시상식 /멀티리더교육"),
    new Schedule("9일","화",".",".",".",".",".",".",".","이한기",".","9일","화","."),
    new Schedule("10일","수","이윤복",".",".",".",".",".",".","김정훈",".","10일","수","리스크예방데이 /의료비 마감"),
    new Schedule("11일","목","이윤복",".",".","최아람",".",".","1030(유)","이한기",".","11일","목","."),
    new Schedule("12일","금","이윤복",".",".",".",".",".",".","김정훈",".","12일","금","."),
    new Schedule("13일","토",".",".",".",".",".",".",".","(제)최민지",".","13일","토","."),
    new Schedule("14일","일",".",".",".",".",".",".",".","(동)백금옥","(동)박정범","14일","일","."),
    new Schedule("15일","월",".",".",".",".",".",".",".","김정훈",".","15일","월","생일의날"),
    new Schedule("16일","화",".",".",".",".",".",".",".","박정범",".","16일","화","."),
    new Schedule("17일","수","김정훈",".",".",".",".",".",".","최민지",".","17일","수","정범네일15:30"),
    new Schedule("18일","목","김정훈",".",".","이진우",".",".","1130(남)","이한기",".","18일","목","통신비마감"),
    new Schedule("19일","금","김정훈",".",".","박주영",".",".","1030(유)","백금옥",".","19일","금","."),
    new Schedule("20일","토",".",".",".",".",".",".",".","(동)최민지",".","20일","토","."),
    new Schedule("21일","일",".",".",".",".",".",".",".",".",".","21일","일","."),
    new Schedule("22일","월","백금옥",".",".",".",".",".",".","최민지",".","22일","월","태길이 사직원 제출일"),
    new Schedule("23일","화","박정범",".",".",".",".",".",".","백금옥",".","23일","화","."),
    new Schedule("24일","수","최민지",".",".","백금옥",".",".","13(남)","이한기",".","24일","수","나교육16~18"),
    new Schedule("25일","목","최아람",".",".","최민지",".",".","1030(남)","최민지",".","25일","목","."),
    new Schedule("26일","금","이한기",".",".","박정범",".",".","1030(유)","박정범",".","26일","금","."),
    new Schedule("27일","토",".",".",".",".",".",".",".","(동)김정훈",".","27일","토","."),
    new Schedule("28일","일",".",".",".",".",".",".",".",".",".","28일","일","."),
    new Schedule("29일","휴일",".",".",".",".",".",".",".","(제)이한기",".","29일","휴일","."),
    new Schedule("30일","화",".",".",".",".",".",".",".","최민지",".","30일","화","멀티리더교육"),
    new Schedule("31일","수",".",".",".","김정훈",".",".","1030(남)","김정훈",".","31일","수",".")
  ]           

//6월

var schedule6 = [
new Schedule("1일","목", "." ,"." ,"." ,"." ,"." ,"." ,"." ,"최민지",".","1일","목","."),
new Schedule("2일","금","이진우",".",".","이한기",".",".","1130남","김정훈",".","2일","금","."),
new Schedule("3일","토",".",".",".",".",".",".",".","(서)이한기",".","3일","토","."),
new Schedule("4일","일",".",".",".",".",".",".",".",".",".","4일","일","."),
new Schedule("5일","월",".",".",".",".",".",".",".","최민지",".","5일","월","."),
new Schedule("6일","휴일",".",".",".",".",".",".",".","(서)박정범",".","6일","휴일","."),
new Schedule("7일","수","최민지(병)",".",".",".",".",".",".","이한기",".","7일","수","정기평가 / 리스크예방데이"),
new Schedule("8일","목","최민지(병)",".",".",".",".",".",".","박정범",".","8일","목","."),
new Schedule("9일","금","이윤복","최민지(병)",".","백금옥",".",".","1030유","김정훈",".","9일","금","."),
new Schedule("10일","토",".",".",".",".",".",".",".","(제)최민지",".","10일","토","."),
new Schedule("11일","일",".",".",".",".",".",".",".","(제)김정훈","이한기","11일","일","."),
new Schedule("12일","월",".",".",".",".",".",".",".","최민지",".","12일","월","."),
new Schedule("13일","화",".",".",".",".",".",".",".","박정범",".","13일","화","."),
new Schedule("14일","수",".",".",".",".",".",".",".","이한기",".","14일","수","."),
new Schedule("15일","목","김정훈",".",".","이진우",".",".","1030유","최민지",".","15일","목","15:30네일(최민지)"),
new Schedule("16일","금","최민지",".",".","박정범",".",".","1600남","이한기",".","16일","금","."),
new Schedule("17일","토",".",".",".",".",".",".",".","(서)김정훈",".","17일","토","."),
new Schedule("18일","일",".",".",".",".",".",".",".",".",".","18일","일","."),
new Schedule("19일","월","박주영",".",".",".",".",".",".","박정범",".","19일","월","."),
new Schedule("20일","화","백금옥","박주영",".",".",".",".",".","이한기",".","20일","화","."),
new Schedule("21일","수","박정범",".",".","박주영",".",".","1030남","최민지",".","21일","수","."),
new Schedule("22일","목","최아람",".",".",".",".",".",".","박정범",".","22일","목","."),
new Schedule("23일","금",".",".",".","최아람",".",".","1030유","김정훈",".","23일","금","."),
new Schedule("24일","토",".",".",".",".",".",".",".","(제)최민지",".","24일","토","."),
new Schedule("25일","일",".",".",".",".",".",".",".",".",".","25일","일","."),
new Schedule("26일","월",".",".",".",".",".",".",".","백금옥",".","26일","월","."),
new Schedule("27일","화",".",".",".","최민지",".",".","1030남","이한기",".","27일","화","."),
new Schedule("28일","수","이한기",".",".","김정훈",".",".","1030유","박정범",".","28일","수","."),
new Schedule("29일","목","이한기",".",".","이윤복",".",".","1130남","최민지",".","29일","목","."),
new Schedule("30일","금","이한기",".",".",".",".",".",".","김정훈",".","30일","금",".")
]

//7월

var schedule7 =[
    new Schedule("1일","토",".",".",".",".",".",".",".","(서)김정훈",".","1일","토","."),
new Schedule("2일","일",".",".",".",".",".",".",".","(서)백금옥","박정범","2일","일","."),
new Schedule("3일","월",".",".",".",".",".",".",".","이한기",".","3일","월","."),
new Schedule("4일","화","이진우",".",".",".",".",".",".","박정범",".","4일","화","."),
new Schedule("5일","수","최민지",".",".","이한기",".",".","1030(유)","백금옥",".","5일","수","정기평가/오스타 시상식"),
new Schedule("6일","목","백금옥",".",".","이진우",".",".","1030(유)","최민지",".","6일","목","."),
new Schedule("7일","금",".",".",".","백금옥",".",".","1030(남)","김정훈",".","7일","금","."),
new Schedule("8일","토",".",".",".",".",".",".",".","(제)이한기",".","8일","토","."),
new Schedule("9일","일",".",".",".",".",".",".",".",".",".","9일","일","."),
new Schedule("10일","월","최아람",".",".",".",".",".",".","최민지",".","10일","월","의료비 마감"),
new Schedule("11일","화",".",".",".",".",".",".",".","이한기",".","11일","화","통품 정기평가 당월면제"),
new Schedule("12일","수","이한기",".",".","박정범",".",".","1030(남)","박정범",".","12일","수","리스크데이"),
new Schedule("13일","목",".",".",".","박주영",".",".","1030(유)","최민지",".","13일","목","."),
new Schedule("14일","금",".",".",".",".",".",".",".","김정훈",".","14일","금","나 레벨업 교육"),
new Schedule("15일","토",".",".",".",".",".",".",".","(서)최민지",".","15일","토","."),
new Schedule("16일","일",".",".",".",".",".",".",".",".",".","16일","일","."),
new Schedule("17일","월",".",".",".",".",".",".",".","박정범",".","17일","월","."),
new Schedule("18일","화",".",".",".",".",".",".",".","백금옥",".","18일","화","."),
new Schedule("19일","수","박정범",".",".","최아람",".",".","1030(남)","최민지",".","19일","수","."),
new Schedule("20일","목","김정훈",".",".","최민지",".",".","1030(남)","이한기",".","20일","목","."),
new Schedule("21일","금","김정훈",".",".","이윤복",".",".","1300(남)","최민지",".","21일","금","통신비마감"),
new Schedule("22일","토",".",".",".",".",".",".",".","(제)박정범",".","22일","토","."),
new Schedule("23일","일",".",".",".",".",".",".",".",".",".","23일","일","."),
new Schedule("24일","월",".",".",".",".",".",".",".","최민지",".","24일","월","."),
new Schedule("25일","화","이윤복",".",".",".",".",".",".","이한기",".","25일","화","."),
new Schedule("26일","수","이윤복",".",".","김정훈",".",".","1300(남)","이한기",".","26일","수","."),
new Schedule("27일","목","박주영",".",".",".",".",".",".","박정범",".","27일","목","."),
new Schedule("28일","금","박주영",".",".",".",".",".",".","김정훈",".","28일","금","."),
new Schedule("29일","토",".",".",".",".",".",".",".","(서)김정훈",".","29일","토","."),
new Schedule("30일","일",".",".",".",".",".",".",".","(제)이한기","최민지","30일","일","."),
new Schedule("31일","월",".",".",".",".",".",".",".","최민지",".","31일","월",".")   
]

//8월

var schedule8 =[
    new Schedule("1일","화",".",".",".",".",".",".",".","최민지",".","1일","화","."),
new Schedule("2일","수","백금옥",".",".",".",".",".",".","이한기",".","2일","수","."),
new Schedule("3일","목","이한기",".",".",".",".",".",".","박정범",".","3일","목","."),
new Schedule("4일","금","이한기",".",".","이진우",".",".","1030(유)","김정훈",".","4일","금","."),
new Schedule("5일","토",".",".",".",".",".",".",".","(서)김정훈",".","5일","토","."),
new Schedule("6일","일",".",".",".",".",".",".",".",".",".","6일","일","."),
new Schedule("7일","월",".",".",".",".",".",".",".","이한기",".","7일","월","내 개인일정 (종각)"),
new Schedule("8일","화","김정훈(반)",".",".",".",".",".",".","최민지",".","8일","화","."),
new Schedule("9일","수",".",".",".",".",".",".",".","박정범",".","9일","수","정기평가/리스크데이/생일날"),
new Schedule("10일","목","최아람",".",".","이한기",".",".","1400(남)","백금옥",".","10일","목","오스타시상/의료비마감"),
new Schedule("11일","금","최아람",".",".","백금옥",".",".","1400(남)","김정훈",".","11일","금","통품자체정기평가 일정"),
new Schedule("12일","토",".",".",".",".",".",".",".","(제)박정범",".","12일","토","."),
new Schedule("13일","일",".",".",".",".",".",".",".",".",".","13일","일","."),
new Schedule("14일","월",".",".",".",".",".",".",".","이한기",".","14일","월","."),
new Schedule("15일","휴일",".",".",".",".",".",".",".","(제)최민지",".","15일","휴일","."),
new Schedule("16일","수",".",".",".",".",".",".",".","이한기",".","16일","수","레벨업교육16~18/개선지표보고/통품정기평가"),
new Schedule("17일","목","박정범",".",".",".",".",".",".","최민지",".","17일","목","."),
new Schedule("18일","금","박정범",".",".","최아람",".",".","1030(남)","백금옥",".","18일","금","통신비취합"),
new Schedule("19일","토",".",".",".",".",".",".",".","(서)김정훈",".","19일","토","."),
new Schedule("20일","일",".",".",".",".",".",".",".","(서)백금옥","이한기","20일","일","."),
new Schedule("21일","월",".",".",".",".",".",".",".","박정범",".","21일","월","."),
new Schedule("22일","화","김정훈(반)",".",".",".",".",".",".","이한기",".","22일","화","."),
new Schedule("23일","수","최민지",".",".","박주영",".",".","1400(유)","이한기",".","23일","수","정범15:30네일아트/나 본사교육"),
new Schedule("24일","목","박주영",".",".","최민지",".",".","1030(유)","최민지",".","24일","목","."),
new Schedule("25일","금","이윤복",".",".","박정범",".",".","1500(남)","김정훈",".","25일","금","."),
new Schedule("26일","토",".",".",".",".",".",".",".","(제최민지",".","26일","토","."),
new Schedule("27일","일",".",".",".",".",".",".",".",".",".","27일","일","."),
new Schedule("28일","월","이진우",".",".",".",".",".",".","최민지",".","28일","월","."),
new Schedule("29일","화","이진우",".",".","이윤복",".",".","1400(남)","박정범",".","29일","화","."),
new Schedule("30일","수","이진우",".",".",".",".",".",".","최민지",".","30일","수","."),
new Schedule("31일","목",".",".",".","김정훈",".",".","1030(유)","박정범",".","31일","목",".")
   
]

//9월

var schedule9 = [

   
new Schedule("1일","금","박주영",".",".",".",".",".",".","이한기",".","1일","금","."),
new Schedule("2일","토",".",".",".",".",".",".",".","(동)김정훈",".","2일","토","."),
new Schedule("3일","일",".",".",".",".",".",".",".","(제)백금옥","이한기","3일","일","."),
new Schedule("4일","월",".",".",".",".",".",".",".","최민지",".","4일","월","."),
new Schedule("5일","화",".",".",".","이한기",".",".","1400(유)","백금옥",".","5일","화","."),
new Schedule("6일","수","김정훈(반)",".",".",".",".",".",".","박정범",".","6일","수","정기평가/ 리스크데이 /생일의날"),
new Schedule("7일","목","백금옥",".",".","최아람",".",".","1300(남)","이한기",".","7일","목","."),
new Schedule("8일","금","백금옥",".",".","이진우",".",".","1300(유)","김정훈",".","8일","금","KS-CQI시상식"),
new Schedule("9일","토",".",".",".",".",".",".",".","(제)최민지",".","9일","토","."),
new Schedule("10일","일",".",".",".",".",".",".",".",".",".","10일","일","."),
new Schedule("11일","월",".",".",".",".",".",".",".","백금옥",".","11일","월","의료비,경조금신청마감"),
new Schedule("12일","화",".",".",".",".",".",".",".","이한기",".","12일","화","통품정평일"),
new Schedule("13일","수","최민지",".",".","이윤복",".",".","1300(유)","박정범",".","13일","수","정범네일15:30 /오스타 시상식"),
new Schedule("14일","목","최아람",".",".","박주영",".",".","1030(남)","최민지",".","14일","목","."),
new Schedule("15일","금","이진우",".",".","박정범",".",".","1300(남)","백금옥",".","15일","금","."),
new Schedule("16일","토",".",".",".",".",".",".",".","(동)최민지",".","16일","토","."),
new Schedule("17일","일",".",".",".",".",".",".",".","(동)김정훈","박정범","17일","일","."),
new Schedule("18일","월",".",".",".",".",".",".",".","최민지",".","18일","월","."),
new Schedule("19일","화",".",".",".",".",".",".",".","최민지",".","19일","화","."),
new Schedule("20일","수","박정범",".",".","최민지",".",".","1300(유)","이한기",".","20일","수","."),
new Schedule("21일","목","김정훈(반)",".",".","백금옥",".",".","1400(남)","최민지",".","21일","목","통신비마감/윤복 네일아트 15:00"),
new Schedule("22일","금","이한기",".",".","김정훈",".",".","1300(남)","김정훈",".","22일","금","."),
new Schedule("23일","토",".",".",".",".",".",".",".","(제)이한기",".","23일","토","."),
new Schedule("24일","일",".",".",".",".",".",".",".",".",".","24일","일","."),
new Schedule("25일","월",".",".",".",".",".",".",".","박정범",".","25일","월","정범교육15~17"),
new Schedule("26일","화",".",".",".",".",".",".",".","백금옥",".","26일","화","."),
new Schedule("27일","수",".",".",".",".",".",".",".","최민지",".","27일","수","."),
new Schedule("28일","휴일",".",".",".",".",".",".",".","(제)김정훈",".","28일","휴일","."),
new Schedule("29일","휴일",".",".",".",".",".",".",".",".",".","29일","휴일","."),
new Schedule("30일","토",".",".",".",".",".",".",".","(동)박정범",".","30일","토","."),
new Schedule("1일","일",".",".",".",".",".",".",".",".",".","1일","일",".")
]

//10월

var schedule10 =[
    new Schedule("1일","일",".",".",".",".",".",".",".",".",".","1일","일","."),
    new Schedule("2일","월",".",".",".",".",".",".",".",".",".","2일","월","."),
    new Schedule("3일","휴일",".",".",".",".",".",".",".",".",".","3일","휴일","."),
    new Schedule("4일","수",".",".",".",".",".",".",".",".",".","4일","수","."),
    new Schedule("5일","목","이윤복",".",".",".",".",".",".",".",".","5일","목","."),
    new Schedule("6일","금","이윤복",".",".",".",".",".",".",".",".","6일","금","."),
    new Schedule("7일","토",".",".",".",".",".",".",".",".",".","7일","토","."),
    new Schedule("8일","일",".",".",".",".",".",".",".",".",".","8일","일","."),
    new Schedule("9일","휴일",".",".",".",".",".",".",".",".",".","9일","휴일","."),
    new Schedule("10일","화",".",".",".",".",".",".",".",".",".","10일","화","."),
    new Schedule("11일","수",".",".",".",".",".",".",".",".",".","11일","수","."),
    new Schedule("12일","목","최민지(장)",".",".",".",".",".",".",".",".","12일","목","."),
    new Schedule("13일","금","최민지",".",".",".",".",".",".",".",".","13일","금","나교육16~18"),
    new Schedule("14일","토",".",".",".",".",".",".",".",".",".","14일","토","."),
    new Schedule("15일","일",".",".",".",".",".",".",".",".",".","15일","일","."),
    new Schedule("16일","월",".",".",".",".",".",".",".",".",".","16일","월","."),
    new Schedule("17일","화",".",".",".",".",".",".",".",".",".","17일","화","."),
    new Schedule("18일","수",".",".",".",".",".",".",".",".",".","18일","수","."),
    new Schedule("19일","목","김정훈",".",".",".",".",".",".",".",".","19일","목","."),
    new Schedule("20일","금","김정훈",".",".",".",".",".",".",".",".","20일","금","."),
    new Schedule("21일","토",".",".",".",".",".",".",".",".",".","21일","토","."),
    new Schedule("22일","일",".",".",".",".",".",".",".",".",".","22일","일","."),
    new Schedule("23일","월",".",".",".",".",".",".",".",".",".","23일","월","."),
    new Schedule("24일","화",".",".",".",".",".",".",".",".",".","24일","화","."),
    new Schedule("25일","수",".",".",".",".",".",".",".",".",".","25일","수","."),
    new Schedule("26일","목",".",".",".",".",".",".",".",".",".","26일","목","."),
    new Schedule("27일","금",".",".",".",".",".",".",".",".",".","27일","금","."),
    new Schedule("28일","토",".",".",".",".",".",".",".",".",".","28일","토","."),
    new Schedule("29일","일",".",".",".",".",".",".",".",".",".","29일","일","."),
    new Schedule("30일","월",".",".",".",".",".",".",".",".",".","30일","월","."),
    new Schedule("31일","화",".",".",".",".",".",".",".",".",".","31일","화",".")

]

//11월

var schedule11 =[

new Schedule("1일","수",".",".",".",".",".",".",".",".",".","1일","수","."),
new Schedule("2일","목",".",".",".",".",".",".",".",".",".","2일","목","."),
new Schedule("3일","금",".",".",".",".",".",".",".",".",".","3일","금","."),
new Schedule("4일","토",".",".",".",".",".",".",".",".",".","4일","토","."),
new Schedule("5일","일",".",".",".",".",".",".",".",".",".","5일","일","."),
new Schedule("6일","월",".",".",".",".",".",".",".",".",".","6일","월","."),
new Schedule("7일","화",".",".",".",".",".",".",".",".",".","7일","화","."),
new Schedule("8일","수",".",".",".",".",".",".",".",".",".","8일","수","."),
new Schedule("9일","목","백금옥",".",".",".",".",".",".",".",".","9일","목","."),
new Schedule("10일","금","백금옥",".",".",".",".",".",".",".",".","10일","금","."),
new Schedule("11일","토",".",".",".",".",".",".",".",".",".","11일","토","."),
new Schedule("12일","일",".",".",".",".",".",".",".",".",".","12일","일","."),
new Schedule("13일","월",".",".",".",".",".",".",".",".",".","13일","월","."),
new Schedule("14일","화",".",".",".",".",".",".",".",".",".","14일","화","."),
new Schedule("15일","수",".",".",".",".",".",".",".",".",".","15일","수","."),
new Schedule("16일","목","박정범",".",".",".",".",".",".",".",".","16일","목","."),
new Schedule("17일","금","박정범",".",".",".",".",".",".",".",".","17일","금","."),
new Schedule("18일","토",".",".",".",".",".",".",".",".",".","18일","토","."),
new Schedule("19일","일",".",".",".",".",".",".",".",".",".","19일","일","."),
new Schedule("20일","월",".",".",".",".",".",".",".",".",".","20일","월","."),
new Schedule("21일","화",".",".",".",".",".",".",".",".",".","21일","화","."),
new Schedule("22일","수",".",".",".",".",".",".",".",".",".","22일","수","."),
new Schedule("23일","목",".",".",".",".",".",".",".",".",".","23일","목","."),
new Schedule("24일","금",".",".",".",".",".",".",".",".",".","24일","금","."),
new Schedule("25일","토",".",".",".",".",".",".",".",".",".","25일","토","."),
new Schedule("26일","일",".",".",".",".",".",".",".",".",".","26일","일","."),
new Schedule("27일","월","최아람",".",".",".",".",".",".",".",".","27일","월","."),
new Schedule("28일","화","최아람",".",".",".",".",".",".",".",".","28일","화","."),
new Schedule("29일","수",".",".",".",".",".",".",".",".",".","29일","수","."),
new Schedule("30일","목",".",".",".",".",".",".",".",".",".","30일","목","."),
new Schedule("1일","금",".",".",".",".",".",".",".",".",".","1일","금",".")

]


//12월

var schedule12 =[

    new Schedule("1일","금",".",".",".",".",".",".",".",".",".","1일","금","."),
    new Schedule("2일","토",".",".",".",".",".",".",".",".",".","2일","토","."),
    new Schedule("3일","일",".",".",".",".",".",".",".",".",".","3일","일","."),
    new Schedule("4일","월",".",".",".",".",".",".",".",".",".","4일","월","."),
    new Schedule("5일","화",".",".",".",".",".",".",".",".",".","5일","화","."),
    new Schedule("6일","수",".",".",".",".",".",".",".",".",".","6일","수","."),
    new Schedule("7일","목",".",".",".",".",".",".",".",".",".","7일","목","."),
    new Schedule("8일","금",".",".",".",".",".",".",".",".",".","8일","금","."),
    new Schedule("9일","토",".",".",".",".",".",".",".",".",".","9일","토","."),
    new Schedule("10일","일",".",".",".",".",".",".",".",".",".","10일","일","."),
    new Schedule("11일","월",".",".",".",".",".",".",".",".",".","11일","월","."),
    new Schedule("12일","화",".",".",".",".",".",".",".",".",".","12일","화","."),
    new Schedule("13일","수",".",".",".",".",".",".",".",".",".","13일","수","."),
    new Schedule("14일","목",".",".",".",".",".",".",".",".",".","14일","목","."),
    new Schedule("15일","금",".",".",".",".",".",".",".",".",".","15일","금","."),
    new Schedule("16일","토",".",".",".",".",".",".",".",".",".","16일","토","."),
    new Schedule("17일","일",".",".",".",".",".",".",".",".",".","17일","일","."),
    new Schedule("18일","월",".",".",".",".",".",".",".",".",".","18일","월","."),
    new Schedule("19일","화",".",".",".",".",".",".",".",".",".","19일","화","."),
    new Schedule("20일","수","최민지",".",".",".",".",".",".",".",".","20일","수","."),
    new Schedule("21일","목","최민지",".",".",".",".",".",".",".",".","21일","목","."),
    new Schedule("22일","금","최민지",".",".",".",".",".",".",".",".","22일","금","."),
    new Schedule("23일","토",".",".",".",".",".",".",".",".",".","23일","토","."),
    new Schedule("24일","일",".",".",".",".",".",".",".",".",".","24일","일","."),
    new Schedule("25일","휴일",".",".",".",".",".",".",".",".",".","25일","휴일","."),
    new Schedule("26일","화",".",".",".",".",".",".",".",".",".","26일","화","."),
    new Schedule("27일","수","이한기(장)",".",".",".",".",".",".",".",".","27일","수","."),
    new Schedule("28일","목","이한기",".",".",".",".",".",".",".",".","28일","목","."),
    new Schedule("29일","금","이한기",".",".",".",".",".",".",".",".","29일","금","."),
    new Schedule("30일","토",".",".",".",".",".",".",".",".",".","30일","토","."),
    new Schedule("31일","일",".",".",".",".",".",".",".",".",".","31일","일",".")    
]


var schemonth =[schedule1,schedule2,schedule3,schedule4,schedule5,schedule6,schedule7,
    schedule8,schedule9,schedule10,schedule11,schedule12] ;

var months = new Date();
var mon = months.getMonth();
console.log(mon)


$(`#changemonth label input[value=${mon}]`).prop('checked',true)
$('.date').text(mon+1+'월');
for (var i=0 ; i<schemonth[mon].length ; i++ ){
         
     
    $('#firstline').before(` <tr class="delnode">
        <td class="tg-0lax schedule1">${schemonth[mon][i].mo}</td>
        <td class="tg-0lax schedule1">${schemonth[mon][i].week}.</td>
        <td class="tg-u4ur schedule1">${schemonth[mon][i].yun1}</td>
        <td class="tg-u4ur schedule1">${schemonth[mon][i].yun2}</td>
        <td class="tg-u4ur schedule1">${schemonth[mon][i].yun3}</td>
        <td class="tg-kd4e schedule1">${schemonth[mon][i].heal1}</td>
        <td class="tg-kd4e schedule1">${schemonth[mon][i].heal2}</td>
        <td class="tg-kd4e schedule1">${schemonth[mon][i].heal3}</td>
        <td class="tg-kd4e schedule1">${schemonth[mon][i].healtime}</td>
        <td class="tg-f7v4 schedule1">${schemonth[mon][i].dang1}</td>
        <td class="tg-f7v4 schedule1">${schemonth[mon][i].dang2}</td>
        <td class="tg-0lax schedule1">${schemonth[mon][i].day2}</td>
        <td class="tg-0lax schedule1">${schemonth[mon][i].week2}</td>
        <td class="tg-0lax schedule1">${schemonth[mon][i].memo}</td>
      </tr>`)
    }
    $("td:contains('일.')").css('background-color','lightgrey');
    $("td:contains('일.')").siblings().css('background-color','lightgrey');
    $("td:contains('토.')").css('background-color','lightgrey');
    $("td:contains('토.')").siblings().css('background-color','lightgrey');

$('#changemonth label input').on('change',function(){
        $('tr').remove('.delnode');            
        var $mon =Number($(this).val())  
        $('.date').text($mon+1+'월');
        console.log($mon);
        for (var i=0 ; i<schemonth[$mon].length ; i++ ){

$('#firstline').before(` <tr class="delnode">
    <td class="tg-0lax schedule1">${schemonth[$mon][i].mo}</td>
    <td class="tg-0lax schedule1">${schemonth[$mon][i].week}.</td>
    <td class="tg-u4ur schedule1">${schemonth[$mon][i].yun1}</td>
    <td class="tg-u4ur schedule1">${schemonth[$mon][i].yun2}</td>
    <td class="tg-u4ur schedule1">${schemonth[$mon][i].yun3}</td>
    <td class="tg-kd4e schedule1">${schemonth[$mon][i].heal1}</td>
    <td class="tg-kd4e schedule1">${schemonth[$mon][i].heal2}</td>
    <td class="tg-kd4e schedule1">${schemonth[$mon][i].heal3}</td>
    <td class="tg-kd4e schedule1">${schemonth[$mon][i].healtime}</td>
    <td class="tg-f7v4 schedule1">${schemonth[$mon][i].dang1}</td>
    <td class="tg-f7v4 schedule1">${schemonth[$mon][i].dang2}</td>
    <td class="tg-0lax schedule1">${schemonth[$mon][i].day2}</td>
    <td class="tg-0lax schedule1">${schemonth[$mon][i].week2}</td>
    <td class="tg-0lax schedule1">${schemonth[$mon][i].memo}</td>
  </tr>`);
 
  $("td:contains('일.')").css('background-color','lightgrey');
  $("td:contains('일.')").siblings().css('background-color','lightgrey');
  $("td:contains('토.')").css('background-color','lightgrey');
  $("td:contains('토.')").siblings().css('background-color','lightgrey');

} //for반복문 끝부분
    }) //change이벤트 끝부분
    

  })

